Revit 2024 API
MEPSection.FrictionFactor Property
 The friction factor of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double FrictionFactor { get; }
Visual Basic
Public ReadOnly Property FrictionFactor As Double
	Get
Visual C++
public:
property double FrictionFactor {
	double get ();
}
Remarks
 Friction Factor is a number. The friction factor type is UT_Number.
See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace